# Building Data Pipline Project 3
Prepared by:

Name: Mohamed Elyass Mohamed Ahmed

Passport: P06382503

School of Data Science

--------------

Will do:

1- Full data extruction from DB SQLite

2- Full data transforming

3- Full data loading

## 1- Data extruction stage:

In [2]:
import numpy as np  
import pandas as pd     
import matplotlib.pyplot as plt   
import seaborn as sns

In [3]:
orders = pd.read_csv(r'C:\Users\HP\Downloads\orders.csv')
products = pd.read_csv(r'C:\Users\HP\Downloads\products.csv')
customers = pd.read_csv(r'C:\Users\HP\Downloads\customers.csv')

In [4]:
orders.head(1)

   order_id  customer_id  product_id  order_date  amount
0     10001           39        1015  2023-08-15  497.49

In [5]:
products.head(1)

   product_id product_name     category   price
0        1001      Medical  Electronics  540.75

In [6]:
customers.head(1)

   customer_id      name                       email   join_date
0            1  Jennifer  buchanankimberly@james.biz  2023-03-31

### Joining

In [7]:
step1 = orders.merge(customers, on='customer_id')
step2 = step1.merge(products, on='product_id')

In [8]:
step2.head(5)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46
1,10008,33,1015,2024-10-22,350.77,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
2,10045,33,1015,2023-04-30,385.34,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
3,10059,24,1015,2023-04-02,269.31,Christopher,barnesmichael@cole.com,2022-08-19,Near,Stationery,754.46
4,10096,18,1015,2025-06-10,440.83,Travis,mjordan@snow.biz,2021-04-18,Near,Stationery,754.46

In [9]:
step2.isnull().sum()

order_id        0
customer_id     0
product_id      0
order_date      0
amount          0
name            0
email           0
join_date       0
product_name    0
category        0
price           0
dtype: int64

In [22]:
step2.duplicated().sum()

0

### "No need for data transform, all looks good for now"

##  Quick analysis (optional)

###  How to list of All products, category and price.

In [10]:
one = step2[["product_name", "category", "price"]]

In [11]:
one.head(5)

  product_name    category   price
0         Near  Stationery  754.46
1         Near  Stationery  754.46
2         Near  Stationery  754.46
3         Near  Stationery  754.46
4         Near  Stationery  754.46

In [12]:
step2.head(1)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46

###  How to find the top 2 old customers.

In [13]:
  
pd.to_datetime(step2["join_date"])  
oldest_customers = step2.sort_values(by="join_date").head(2)

In [14]:
oldest_customers

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
47,10019,30,1027,2024-04-22,316.66,Kelly,valerie91@hotmail.com,2020-07-22,Main,Stationery,920.95
11,10090,30,1037,2022-11-28,175.03,Kelly,valerie91@hotmail.com,2020-07-22,Dog,Stationery,51.40

###  How to find the top 5 customers by total purchase amount.

In [15]:
step2.head(1)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46

In [16]:
step2.groupby('name')['amount'].sum().sort_values(ascending=False).head(5)

name
Kristen      1849.78
Ashlee       1420.57
Gina         1407.62
Jamie        1374.69
Stephanie    1361.19
Name: amount, dtype: float64

###  How to identify products that have never been ordered.

In [17]:
step2.groupby('product_name')['order_id'].value_counts().sort_values(ascending=True)

product_name  order_id
Accept        10063       1
Science       10030       1
Resource      10011       1
              10041       1
              10043       1
                         ..
Discuss       10089       1
              10091       1
              10010       1
Ever          10005       1
Yard          10083       1
Name: count, Length: 100, dtype: int64

In [18]:
step2["order_id"].isna().sum()

0

In [19]:
step2[['order_id', 'product_name']]

    order_id product_name
0      10001         Near
1      10008         Near
2      10045         Near
3      10059         Near
4      10096         Near
..       ...          ...
95     10080         Site
96     10068        Sport
97     10070         East
98     10085          Our
99     10099      Require

[100 rows x 2 columns]

###  How to identify products that have maximum ordered.

In [20]:
step2.head(4)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46
1,10008,33,1015,2024-10-22,350.77,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
2,10045,33,1015,2023-04-30,385.34,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
3,10059,24,1015,2023-04-02,269.31,Christopher,barnesmichael@cole.com,2022-08-19,Near,Stationery,754.46

In [21]:
step2.groupby('order_id')['product_name'].sum().value_counts().head(5)

product_name
Black      6
Near       5
Central    5
Discuss    4
Region     4
Name: count, dtype: int64

##  Data loading stage:

### 1- To Google BigQuery

In [23]:
### Done

###  2- To csv file

In [25]:
step2.to_csv('cleaned_orders_data.csv', index=False)

### 3- To DB SQLite

In [28]:
# First, check if your DataFrame exists and has data
print("DataFrame info:")
print(f"Shape: {step2.shape}")
print(f"Columns: {step2.columns.tolist()}")
print(f"First few rows:")
print(step2.head())

# Now save to database with error handling
import sqlite3
import pandas as pd

try:
    # Create connection
    conn = sqlite3.connect('orders_data.db')
    
    # Save DataFrame to database
    step2.to_sql('orders', conn, if_exists='replace', index=False)
    
    # Verify it worked
    cursor = conn.cursor()
    cursor.execute("SELECT COUNT(*) FROM orders;")
    row_count = cursor.fetchone()[0]
    print(f"Successfully saved {row_count} rows to database!")
    
    # Show table names
    cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = cursor.fetchall()
    print(f"Tables in database: {tables}")
    
    conn.close()
    
except Exception as e:
    print(f"Error: {e}")
    conn.close()

DataFrame info:
Shape: (100, 11)
Columns: ['order_id', 'customer_id', 'product_id', 'order_date', 'amount', 'name', 'email', 'join_date', 'product_name', 'category', 'price']
First few rows:
   order_id  customer_id  product_id  order_date  amount         name  \
0     10001           39        1015  2023-08-15  497.49      Kristen
1     10008           33        1015  2024-10-22  350.77        Jared
2     10045           33        1015  2023-04-30  385.34        Jared
3     10059           24        1015  2023-04-02  269.31  Christopher
4     10096           18        1015  2025-06-10  440.83       Travis

                       email   join_date product_name    category   price
0  jenniferpratt@hotmail.com  2022-04-21         Near  Stationery  754.46
1         austin98@gmail.com  2023-12-10         Near  Stationery  754.46
2         austin98@gmail.com  2023-12-10         Near  Stationery  754.46
3     barnesmichael@cole.com  2022-08-19         Near  Stationery  754.46
4           mjordan@snow.biz  2021-04-18         Near  Stationery  754.46
Successfully saved 100 rows to database!
Tables in database: [('orders',)]

## Done